# 1. Data Frame
## 1.1. Tạo `dataframe`

In [1]:
students_1 = data.frame('name'=c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom'),
                       'age'=c(17, 16, 17, 18, 19, 16),
                       'mark'=c(9, 9, 8, 7.5, 7.5, 8),
                       stringsAsFactors=FALSE)

students_1

  name   age mark
1 Hellen 17  9.0
2 Jolie  16  9.0
3 Kiwi   17  8.0
4 John   18  7.5
5 Mark   19  7.5
6 Tom    16  8.0

In [2]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)

students = data.frame(name, age, mark, stringsAsFactors=FALSE)

students

  name   age mark
1 Hellen 17  9.0
2 Jolie  16  9.0
3 Kiwi   17  8.0
4 John   18  7.5
5 Mark   19  7.5
6 Tom    16  8.0

## 1.2. Xem cấu trúc của `dataframe`

In [3]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

str(students)

'data.frame':	6 obs. of  3 variables:
 $ name: chr  "Hellen" "Jolie" "Kiwi" "John" ...
 $ age : num  17 16 17 18 19 16
 $ mark: num  9 9 8 7.5 7.5 8

## 1.3. Xem thống kê tóm tắt của dữ liệu

In [4]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

summary(students)

     name                age             mark
 Length:6           Min.   :16.00   Min.   :7.500
 Class :character   1st Qu.:16.25   1st Qu.:7.625
 Mode  :character   Median :17.00   Median :8.000
                    Mean   :17.17   Mean   :8.167
                    3rd Qu.:17.75   3rd Qu.:8.750
                    Max.   :19.00   Max.   :9.000

## 1.3. Truy xuất dữ liệu từ `dataframe`

In [5]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

students$mark

[1] 9.0 9.0 8.0 7.5 7.5 8.0

In [6]:
students[1:2, ]

  name   age mark
1 Hellen 17  9
2 Jolie  16  9

* Get `age` column as `dataframe`

In [7]:
tmp = data.frame(students$age)
tmp

  students.age
1 17
2 16
3 17
4 18
5 19
6 16

In [8]:
students[c(3, 5), c(1, 2)]

  name age
3 Kiwi 17
5 Mark 19

## 1.4. Thêm một cột mới vào `dataframe`

In [9]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

students$class = c('Toán', 'Lí', 'Hóa', 'Văn', 'Sử', 'Địa')

students

  name   age mark class
1 Hellen 17  9.0  Toán
2 Jolie  16  9.0  Lí
3 Kiwi   17  8.0  Hóa
4 John   18  7.5  Văn
5 Mark   19  7.5  Sử
6 Tom    16  8.0  Địa

In [10]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

country = c('Mỹ', 'Anh', 'Pháp', 'Nga', 'Nhật', 'Hàn')
students = cbind(students, country)

students

  name   age mark country
1 Hellen 17  9.0  Mỹ
2 Jolie  16  9.0  Anh
3 Kiwi   17  8.0  Pháp
4 John   18  7.5  Nga
5 Mark   19  7.5  Nhật
6 Tom    16  8.0  Hàn

# 1.5. Thêm dòng

In [11]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

new_student = data.frame(name=c('Cường', 'Tèo'), age=c(22, 22), mark=c(10, 10), stringsAsFactors=FALSE)
students = rbind(students, new_student)

students

  name   age mark
1 Hellen 17   9.0
2 Jolie  16   9.0
3 Kiwi   17   8.0
4 John   18   7.5
5 Mark   19   7.5
6 Tom    16   8.0
7 Cường  22  10.0
8 Tèo    22  10.0

In [14]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

new_student_2 = list('Cường', 22, 10)
students = rbind(students, new_student_2)

students

  name   age mark
1 Hellen 17   9.0
2 Jolie  16   9.0
3 Kiwi   17   8.0
4 John   18   7.5
5 Mark   19   7.5
6 Tom    16   8.0
7 Cường  22  10.0

## 1.6. Đổi tên cột

In [15]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

names(students)[names(students) == 'mark'] = 'score'

students

  name   age score
1 Hellen 17  9.0
2 Jolie  16  9.0
3 Kiwi   17  8.0
4 John   18  7.5
5 Mark   19  7.5
6 Tom    16  8.0

## 1.7. In vài dòng đầu và vài dòng cuối

In [16]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

In [17]:
head(students)

  name   age mark
1 Hellen 17  9.0
2 Jolie  16  9.0
3 Kiwi   17  8.0
4 John   18  7.5
5 Mark   19  7.5
6 Tom    16  8.0

In [18]:
tail(students)

  name   age mark
1 Hellen 17  9.0
2 Jolie  16  9.0
3 Kiwi   17  8.0
4 John   18  7.5
5 Mark   19  7.5
6 Tom    16  8.0

# 2. Tidyverse
## 2.1. Install

In [22]:
install.packages('tidyverse')
install.packages('httpuv') # cài chơi ko sài trog bài này

Installing package into ‘/home/manhcuong/R/x86_64-pc-linux-gnu-library/4.1’
(as ‘lib’ is unspecified)

Installing package into ‘/home/manhcuong/R/x86_64-pc-linux-gnu-library/4.1’
(as ‘lib’ is unspecified)

## 2.2. Import

In [21]:
library(tidyverse)

## 2.3. Load dữ liệu `pokemon`

In [25]:
pokemon = read.csv('./data/pokemon.csv')

head(pokemon)

  X. Name                  Type.1 Type.2 Total HP Attack Defense Sp..Atk
1 1  Bulbasaur             Grass  Poison 318   45  49     49      65
2 2  Ivysaur               Grass  Poison 405   60  62     63      80
3 3  Venusaur              Grass  Poison 525   80  82     83     100
4 3  VenusaurMega Venusaur Grass  Poison 625   80 100    123     122
5 4  Charmander            Fire          309   39  52     43      60
6 5  Charmeleon            Fire          405   58  64     58      80
  Sp..Def Speed Generation Legendary
1  65     45    1          False
2  80     60    1          False
3 100     80    1          False
4 120     80    1          False
5  50     65    1          False
6  65     80    1          False